#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/nwmahoney/gha-tf-aws-ecs-example/runs/run-WZxwzy6Vkjw8mELw

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.aws_ssm_parameter.ecs_optimized_ami: Refreshing...
module.autoscaling["one"].data.aws_default_tags.current: Refreshing...
module.autoscaling["two"].data.aws_partition.current: Refreshing...
module.autoscaling["one"].data.aws_partition.current: Refreshing...
module.autoscaling["two"].data.aws_default_tags.current: Refreshing...
module.autoscaling["two"].data.aws_partition.current: Refresh complete after 0s [id=aws]
module.autoscaling["one"].data.aws_default_tags.current: Refresh complete after 0s [id=aws]
module.autoscaling["one"].data.aws_partition.current: Refresh complete after 0s [id=aws]
module.autoscaling["two"].data.aws_default_tags.current: Refresh complete after 0s [id=aws]
module.autoscaling["two"].data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.autoscaling["one"].data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.autoscaling["two"].data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=1256122602]
module.autoscaling["one"].data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=1256122602]
data.aws_ssm_parameter.ecs_optimized_ami: Refresh complete after 1s [id=/aws/service/ecs/optimized-ami/amazon-linux-2/recommended]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/gha-tf-aws-ecs-example"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all          = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
    }

  # module.autoscaling["one"].aws_autoscaling_group.idc[0] will be created
  + resource "aws_autoscaling_group" "idc" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = "gha-tf-aws-ecs-example-one-"
      + protect_from_scale_in     = true
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = []
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "gha-tf-aws-ecs-example-one"
        }
      + tag {
          + key                 = "Repository"
          + propagate_at_launch = true
          + value               = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }

      + timeouts {}
    }

  # module.autoscaling["one"].aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "gha-tf-aws-ecs-example-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all    = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + unique_id   = (known after apply)
    }

  # module.autoscaling["one"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EC2AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS role for gha-tf-aws-ecs-example"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "gha-tf-aws-ecs-example-"
      + path                  = "/"
      + tags                  = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all              = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + unique_id             = (known after apply)
    }

  # module.autoscaling["one"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = (known after apply)
    }

  # module.autoscaling["one"].aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.autoscaling["one"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = (sensitive value)
      + instance_type          = "t3.micro"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "gha-tf-aws-ecs-example-one-"
      + tags                   = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all               = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + user_data              = "IyEvYmluL2Jhc2gKY2F0IDw8J0VPRicgPj4gL2V0Yy9lY3MvZWNzLmNvbmZpZwpFQ1NfQ0xVU1RFUj1naGEtdGYtYXdzLWVjcy1leGFtcGxlCkVDU19MT0dMRVZFTD1kZWJ1ZwpFT0YK"
      + vpc_security_group_ids = (known after apply)

      + monitoring {
          + enabled = true
        }
    }

  # module.autoscaling["two"].aws_autoscaling_group.idc[0] will be created
  + resource "aws_autoscaling_group" "idc" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = "gha-tf-aws-ecs-example-two-"
      + protect_from_scale_in     = true
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = []
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "gha-tf-aws-ecs-example-two"
        }
      + tag {
          + key                 = "Repository"
          + propagate_at_launch = true
          + value               = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }

      + timeouts {}
    }

  # module.autoscaling["two"].aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "gha-tf-aws-ecs-example-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all    = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + unique_id   = (known after apply)
    }

  # module.autoscaling["two"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EC2AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS role for gha-tf-aws-ecs-example"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "gha-tf-aws-ecs-example-"
      + path                  = "/"
      + tags                  = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all              = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + unique_id             = (known after apply)
    }

  # module.autoscaling["two"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = (known after apply)
    }

  # module.autoscaling["two"].aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.autoscaling["two"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = (sensitive value)
      + instance_type          = "t3.small"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "gha-tf-aws-ecs-example-two-"
      + tags                   = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all               = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + user_data              = "IyEvYmluL2Jhc2gKY2F0IDw8J0VPRicgPj4gL2V0Yy9lY3MvZWNzLmNvbmZpZwpFQ1NfQ0xVU1RFUj1naGEtdGYtYXdzLWVjcy1leGFtcGxlCkVDU19MT0dMRVZFTD1kZWJ1ZwpFT0YK"
      + vpc_security_group_ids = (known after apply)

      + monitoring {
          + enabled = true
        }
    }

  # module.autoscaling_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Autoscaling group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "gha-tf-aws-ecs-example-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all               = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.autoscaling_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.autoscaling_sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.ecs.aws_ecs_capacity_provider.this["one"] will be created
  + resource "aws_ecs_capacity_provider" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "one"
      + tags     = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_termination_protection = "ENABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 5
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 60
            }
        }
    }

  # module.ecs.aws_ecs_capacity_provider.this["two"] will be created
  + resource "aws_ecs_capacity_provider" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "two"
      + tags     = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_termination_protection = "ENABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 15
              + minimum_scaling_step_size = 5
              + status                    = "ENABLED"
              + target_capacity           = 90
            }
        }
    }

  # module.ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "gha-tf-aws-ecs-example"
      + tags               = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all           = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_log_group_name = "/aws/ecs/gha-tf-aws-ecs-example"
                }
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
          + "one",
          + "two",
        ]
      + cluster_name       = "gha-tf-aws-ecs-example"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "two"
          + weight            = 40
        }
      + default_capacity_provider_strategy {
          + base              = 20
          + capacity_provider = "one"
          + weight            = 60
        }
    }

  # module.hello_world.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + name_prefix       = "hello_world-"
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.hello_world.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "hello_world"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false
    }

  # module.hello_world.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                   = (known after apply)
      + arn_without_revision  = (known after apply)
      + container_definitions = (known after apply)
      + family                = "hello_world"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
      + skip_destroy          = false
      + tags_all              = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all             = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all             = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all         = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all         = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.99.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all                                       = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.99.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all                                       = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.99.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all                                       = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.99.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all                                       = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.99.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all                                       = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.99.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all                                       = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.99.0.0/18"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
      + tags_all                             = {
          + "Name"       = "gha-tf-aws-ecs-example"
          + "Repository" = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
        }
    }

Plan: 43 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + autoscaling_capacity_providers = {
      + one = {
          + auto_scaling_group_provider = [
              + {
                  + managed_scaling                = [
                      + {
                          + maximum_scaling_step_size = 5
                          + minimum_scaling_step_size = 1
                          + status                    = "ENABLED"
                          + target_capacity           = 60
                        },
                    ]
                  + managed_termination_protection = "ENABLED"
                },
            ]
          + name                        = "one"
          + tags                        = {
              + Name       = "gha-tf-aws-ecs-example"
              + Repository = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
            }
          + tags_all                    = {
              + Name       = "gha-tf-aws-ecs-example"
              + Repository = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
            }
        }
      + two = {
          + auto_scaling_group_provider = [
              + {
                  + managed_scaling                = [
                      + {
                          + maximum_scaling_step_size = 15
                          + minimum_scaling_step_size = 5
                          + status                    = "ENABLED"
                          + target_capacity           = 90
                        },
                    ]
                  + managed_termination_protection = "ENABLED"
                },
            ]
          + name                        = "two"
          + tags                        = {
              + Name       = "gha-tf-aws-ecs-example"
              + Repository = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
            }
          + tags_all                    = {
              + Name       = "gha-tf-aws-ecs-example"
              + Repository = "https://github.com/nwmahoney/gha-tf-aws-ecs-example"
            }
        }
    }
  + cluster_arn                    = (known after apply)
  + cluster_capacity_providers     = (known after apply)
  + cluster_id                     = (known after apply)
  + cluster_name                   = "gha-tf-aws-ecs-example"

```

</details>

*Pushed by: @nwmahoney, Action: `pull_request`*